SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
void BLEManagerImpl::HandleConnectEvent(volatile sl_bt_msg_t * evt)
{

    sl_bt_evt_connection_opened_t * conn_evt = (sl_bt_evt_connection_opened_t *) &(evt->data);

    if (conn_evt->advertiser == mAdvertisingSetHandle)
    {
        ChipLogProgress(DeviceLayer, "Connect Event for CHIPoBLE on handle : %d", conn_evt->connection);

        AddConnection(conn_evt->connection, conn_evt->bonding);
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
    else
    {
        // We assumed we are using the side channel from the moment we
        // are not using the CHIPoBLE service.
        VerifyOrReturn(mBleSideChannel != nullptr);
        ChipLogProgress(DeviceLayer, "Connect Event for SideChannel on handle : %d", conn_evt->connection);
        mBleSideChannel->AddConnection(conn_evt->connection, conn_evt->bonding);
        return;
    }
}

void BLEManagerImpl::HandleConnectParams(volatile sl_bt_msg_t * evt)
{
    sl_bt_evt_connection_parameters_t * con_param_evt = (sl_bt_evt_connection_parameters_t *) &(evt->data);

    // If the connection belongs to the CHIPoBLE service

    ChipLogProgress(DeviceLayer, "Connection Parameters Event for handle : %d", con_param_evt->connection);
    ChipLogProgress(DeviceLayer, "Interval: %d, Latency: %d, Timeout: %d", con_param_evt->interval, con_param_evt->latency,
                    con_param_evt->timeout);

    uint16_t desiredTimeout = con_param_evt->timeout < BLE_CONFIG_TIMEOUT ? BLE_CONFIG_TIMEOUT : con_param_evt->timeout;

    // For better stability, renegotiate the connection parameters if the received ones from the central are outside
    // of our defined constraints
    if (desiredTimeout != con_param_evt->timeout || con_param_evt->interval < BLE_CONFIG_MIN_INTERVAL ||
        con_param_evt->interval > BLE_CONFIG_MAX_INTERVAL)
    {
        ChipLogProgress(DeviceLayer, "Renegotiate BLE connection parameters to minInterval:%d, maxInterval:%d, timeout:%d",
                        BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL, desiredTimeout);
        sl_bt_connection_set_parameters(con_param_evt->connection, BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL,
                                        BLE_CONFIG_LATENCY, desiredTimeout, BLE_CONFIG_MIN_CE_LENGTH, BLE_CONFIG_MAX_CE_LENGTH);
    }

    if (NULL != GetConnectionState(con_param_evt->connection, false))
    {
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
}

void BLEManagerImpl::HandleConnectionCloseEvent(volatile sl_bt_msg_t * evt)
{
    sl_bt_evt_connection_closed_t * conn_evt = (sl_bt_evt_connection_closed_t *) &(evt->data);

    if (NULL != GetConnectionState(conn_evt->connection, false))
    {
        ChipLogProgress(DeviceLayer, "Disconnect Event for CHIPoBLE on handle : %d", conn_evt->connection);
        if (RemoveConnection(conn_evt->connection))
        {
            ChipDeviceEvent event;
            event.Type                          = DeviceEventType::kCHIPoBLEConnectionError;
            event.CHIPoBLEConnectionError.ConId = conn_evt->connection;

            switch (conn_evt->reason)
            {
            case SL_STATUS_BT_CTRL_REMOTE_USER_TERMINATED:
            case SL_STATUS_BT_CTRL_REMOTE_DEVICE_TERMINATED_CONNECTION_DUE_TO_LOW_RESOURCES:
            case SL_STATUS_BT_CTRL_REMOTE_POWERING_OFF:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_REMOTE_DEVICE_DISCONNECTED;
                break;

            case SL_STATUS_BT_CTRL_CONNECTION_TERMINATED_BY_LOCAL_HOST:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_APP_CLOSED_CONNECTION;
                break;

            default:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_CHIPOBLE_PROTOCOL_ABORT;
                break;
            }

            ChipLogProgress(DeviceLayer, "BLE GATT connection closed (con %u, reason %u)", conn_evt->connection, conn_evt->reason);

            PlatformMgr().PostEventOrDie(&event);

            // Arrange to re-enable connectable advertising in case it was disabled due to the
            // maximum connection limit being reached.
            mFlags.Set(Flags::kRestartAdvertising);
            mFlags.Set(Flags::kFastAdvertisingEnabled);
        }

        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
    else
    {
        VerifyOrReturn(mBleSideChannel != nullptr);
        ChipLogProgress(DeviceLayer, "Disconnect Event for the Side Channel on handle : %d", conn_evt->connection);
        mBleSideChannel->RemoveConnection(conn_evt->connection);
    }
}

void BLEManagerImpl::HandleWriteEvent(volatile sl_bt_msg_t * evt)
{
    if (GetConnectionState(evt->data.evt_gatt_server_user_write_request.connection))
    {
        uint16_t attribute = evt->data.evt_gatt_server_user_write_request.characteristic;
        bool do_provision  = chip::DeviceLayer::Silabs::Provision::Manager::GetInstance().IsProvisionRequired();
        ChipLogProgress(DeviceLayer, "Char Write Req, char : %d", attribute);

        if (gattdb_CHIPoBLEChar_Rx == attribute)
        {
            if (do_provision)
            {
                chip::DeviceLayer::Silabs::Provision::Channel::Update(attribute);
                chip::DeviceLayer::Silabs::Provision::Manager::GetInstance().Step();
            }
            else
            {
                HandleRXCharWrite(evt);
            }
        }
    }
    else if (isCHIPoBLECharacteristic(evt->data.evt_gatt_server_user_write_request.characteristic))
    {
        // Prevent to write CHIPoBLE Characteristics from other connections
        // This will fail if the characteristic has the WRITE_NO_RESPONSE property
        sl_bt_gatt_server_send_user_write_response(evt->data.evt_gatt_server_user_write_request.connection,
                                                   evt->data.evt_gatt_server_user_write_request.characteristic, 0x01);
        return;
    }
    else
    {
        VerifyOrReturn(mBleSideChannel != nullptr);

        uint8_t dataBuff[255] = { 0 };
        MutableByteSpan dataSpan(dataBuff);
        mBleSideChannel->HandleWriteRequest(evt, dataSpan);

        // Buffered (&Deleted) the following data:
        ChipLogProgress(DeviceLayer, "Buffered (&Deleted) the following data:");
        ChipLogByteSpan(DeviceLayer, dataSpan);
    }
}

void BLEManagerImpl::HandleTXCharCCCDWrite(volatile sl_bt_msg_t * evt)
{
    CHIP_ERROR err = CHIP_NO_ERROR;
    BLEConState * bleConnState;
    bleConnState = GetConnectionState(evt->data.evt_gatt_server_user_write_request.connection);

    if (NULL != bleConnState)
    {
        if ((evt->data.evt_gatt_server_characteristic_status.characteristic == gattdb_CHIPoBLEChar_Tx) &&
            (evt->data.evt_gatt_server_characteristic_status.status_flags == sl_bt_gatt_server_client_config))
        {
            bool isIndicationEnabled = false;
            ChipDeviceEvent event;
            // Determine if the client is enabling or disabling notification/indication.
            isIndicationEnabled = (evt->data.evt_gatt_server_characteristic_status.client_config_flags == sl_bt_gatt_indication);

